# vsoSetGlazingArea

```pascal
PROCEDURE vsoSetGlazingArea(GlazingArea : REAL);
```

```python
def vs.vsoSetGlazingArea(GlazingArea):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|GlazingArea|REAL|   |

## Examples
```pascal
vsoSetGlazingArea(1.0);
```
```python
import vs

GlazingArea = 1.0

vs.vsoSetGlazingArea(GlazingArea)
```

## Version
Availability: from Vectorworks 2020

## Category
* Object Events